In [1]:
import pandas as pd

In [2]:
cols = ['bronze', 'country_name', 'gold', 'silver']

countries = ['Russian Fed.', 'Norway', 'Canada', 'United States',
             'Netherlands', 'Germany', 'Switzerland', 'Belarus',
             'Austria', 'France', 'Poland', 'China', 'Korea', 
             'Sweden', 'Czech Republic', 'Slovenia', 'Japan',
             'Finland', 'Great Britain', 'Ukraine', 'Slovakia',
             'Italy', 'Latvia', 'Australia', 'Croatia', 'Kazakhstan']

gold = [13, 11, 10, 9, 8, 8, 6, 5, 4, 4, 4, 3, 3, 2, 2, 2, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0]

silver = [11, 5, 10, 7, 7, 6, 3, 0, 8, 4, 1, 4, 3, 7, 4, 2, 4, 3, 1, 0, 0, 2, 2, 2, 1, 0]

bronze = [9, 10, 5, 12, 9, 5, 2, 1, 5, 7, 1, 2, 2, 6, 2, 4, 3, 1, 2, 1, 0, 6, 2, 1, 0, 1]

In [3]:
# create dictionary (key-value pairs)
# key: object
# value: lists 

medal_dict = {'country_name': countries,
             'gold': gold,
              'silver': silver,
              'bronze': bronze
             }

In [8]:
olympic_medal_counts = pd.DataFrame(medal_dict, columns=cols)
olympic_medal_counts

    bronze    country_name  gold  silver
0        9    Russian Fed.    13      11
1       10          Norway    11       5
2        5          Canada    10      10
3       12   United States     9       7
4        9     Netherlands     8       7
5        5         Germany     8       6
6        2     Switzerland     6       3
7        1         Belarus     5       0
8        5         Austria     4       8
9        7          France     4       4
10       1          Poland     4       1
11       2           China     3       4
12       2           Korea     3       3
13       6          Sweden     2       7
14       2  Czech Republic     2       4
15       4        Slovenia     2       2
16       3           Japan     1       4
17       1         Finland     1       3
18       2   Great Britain     1       1
19       1         Ukraine     1       0
20       0        Slovakia     1       0
21       6           Italy     0       2
22       2          Latvia     0       2
23       1       Australia     0       2
24       0         Croatia     0       1
25       1      Kazakhstan     0       0

In [11]:
lst = ['gold', 'silver', 'bronze']
v_medals = olympic_medal_counts.loc[:, lst]
v_medals.head()

   gold  silver  bronze
0    13      11       9
1    11       5      10
2    10      10       5
3     9       7      12
4     8       7       9

In [12]:
v_medals.shape

(26, 3)

In [24]:
# we need 26 x 3 dot 3 x 1 
# this would give a 26 x 1 series which we can concatenate with the 26 x 1 country_name's series

lst = ['gold', 'silver', 'bronze']
v_medals = olympic_medal_counts.loc[:, lst]
v_medals.head()

   gold  silver  bronze
0    13      11       9
1    11       5      10
2    10      10       5
3     9       7      12
4     8       7       9

In [25]:
v_medals.shape

(26, 3)

In [26]:
type(v_medals)

pandas.core.frame.DataFrame

In [17]:
medal_points = [4, 2, 1]

In [21]:
# create series

v_points = pd.Series(medal_points)
v_points.shape

(3,)

In [27]:
import numpy as np 

np.dot(v_medals, v_points)

array([83, 64, 65, 62, 55, 49, 32, 21, 37, 31, 19, 22, 20, 28, 18, 16, 15,
       11,  8,  5,  4, 10,  6,  5,  2,  1])

In [30]:
v_total_points = pd.Series(np.dot(v_medals, v_points))
v_total_points.head()

0    83
1    64
2    65
3    62
4    55
dtype: int64

In [34]:
v_countries = olympic_medal_counts.loc[:, 'country_name']
country_score = pd.concat([v_countries, v_total_points], axis=1)
country_score.head()

    country_name   0
0   Russian Fed.  83
1         Norway  64
2         Canada  65
3  United States  62
4    Netherlands  55

In [37]:
# rename columns

country_score.columns = ['country_name', 'total_points']
country_score.head(10)

    country_name  total_points
0   Russian Fed.            83
1         Norway            64
2         Canada            65
3  United States            62
4    Netherlands            55
5        Germany            49
6    Switzerland            32
7        Belarus            21
8        Austria            37
9         France            31